In [1634]:
# Instalamos e importamos librer√≠as.

%pip install SQLAlchemy
%pip install pymysql

import pandas as pd

import random

from sqlalchemy import create_engine

Requirement already satisfied: SQLAlchemy in /Users/yasmin/opt/anaconda3/lib/python3.9/site-packages (1.4.22)
Requirement already satisfied: greenlet!=0.4.17 in /Users/yasmin/opt/anaconda3/lib/python3.9/site-packages (from SQLAlchemy) (1.1.1)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: pymysql in /Users/yasmin/opt/anaconda3/lib/python3.9/site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

# Tabla 'ACTOR'

In [1635]:
# Descargamos el CSV de la tabla 'ACTOR'

pd.set_option('display.max_columns', None)

actor=pd.read_csv('../data/actor.csv')

actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [1636]:
# Miramos que no haya duplicados.

actor.drop_duplicates().shape == actor.shape

True

In [1637]:
# Miramos las filas y columnas que tiene.

actor.shape

(200, 4)

In [1638]:
actor.isna().sum()

actor_id       0
first_name     0
last_name      0
last_update    0
dtype: int64

In [1639]:
actor.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 41.0 KB

In [1640]:
# Juntamos las columnas first_name y last_name en una nueva llamada complete_name.

complete_name = actor.first_name + " " + actor.last_name

complete_name

0         PENELOPE GUINESS
1            NICK WAHLBERG
2                 ED CHASE
3           JENNIFER DAVIS
4      JOHNNY LOLLOBRIGIDA
              ...
195            BELA WALKEN
196             REESE WEST
197            MARY KEITEL
198          JULIA FAWCETT
199           THORA TEMPLE
Length: 200, dtype: object

In [1641]:
actor ['complete_name'] = complete_name

In [1642]:
# Comprobamos que se cree la nueva columna.

actor.head()

   actor_id first_name     last_name          last_update        complete_name
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33     PENELOPE GUINESS
1         2       NICK      WAHLBERG  2006-02-15 04:34:33        NICK WAHLBERG
2         3         ED         CHASE  2006-02-15 04:34:33             ED CHASE
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33  JOHNNY LOLLOBRIGIDA

# Tabla 'CATEGORY'

In [1643]:
# Descargamos el CSV de la tabla 'CATEGORY'
category=pd.read_csv('../data/category.csv')

category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [1644]:
category.drop_duplicates().shape == category.shape

True

In [1645]:
category.shape

(16, 3)

In [1646]:
category.isna().sum()

category_id    0
name           0
last_update    0
dtype: int64

In [1647]:
category.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 2.4 KB

# Tabla 'FILM'

In [1648]:
# Descargamos el CSV de la tabla 'FILM'

film=pd.read_csv('../data/film.csv')

film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [1649]:
film.drop_duplicates().shape == film.shape

True

In [1650]:
film.shape

(1000, 13)

In [1651]:
# Miramos los nulos.

film.isna().sum()

film_id                    0
title                      0
description                0
release_year               0
language_id                0
original_language_id    1000
rental_duration            0
rental_rate                0
length                     0
replacement_cost           0
rating                     0
special_features           0
last_update                0
dtype: int64

In [1652]:
# Borramos la columna de nulos.

film.drop(['original_language_id'], axis = 1, inplace=True)

In [1653]:
film.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'rental_duration', 'rental_rate', 'length', 'replacement_cost',
       'rating', 'special_features', 'last_update'],
      dtype='object')

In [1654]:
film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   release_year      1000 non-null   int64
 4   language_id       1000 non-null   int64
 5   rental_duration   1000 non-null   int64
 6   rental_rate       1000 non-null   float64
 7   length            1000 non-null   int64
 8   replacement_cost  1000 non-null   float64
 9   rating            1000 non-null   object
 10  special_features  1000 non-null   object
 11  last_update       1000 non-null   object
dtypes: float64(2), int64(5), object(5)
memory usage: 487.5 KB

# Tabla 'INVENTORY'

In [1655]:
# Descargamos el CSV de la tabla 'INVENTORY'

inventory=pd.read_csv('../data/inventory.csv')

inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [1656]:
inventory.drop_duplicates().shape == inventory.shape

True

In [1657]:
inventory.shape

(1000, 4)

In [1658]:
inventory.isna().sum()

inventory_id    0
film_id         0
store_id        0
last_update     0
dtype: int64

In [1659]:
inventory.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 97.8 KB

In [1660]:
inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

# Tabla 'LANGUAGE'

In [1661]:
# Descargamos el CSV de la tabla 'LANGUAGE'

language=pd.read_csv('../data/language.csv')

language.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [1662]:
language.drop_duplicates().shape == language.shape

True

In [1663]:
language.shape

(6, 3)

In [1664]:
language.isna().sum()

language_id    0
name           0
last_update    0
dtype: int64

In [1665]:
language.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 1016.0 bytes

# Tabla 'OLD_HDD' que vamos a renombrar como 'FILMACTOR'

In [1666]:
# Descargamos el CSV de la tabla 'OLD-HDD'

old_HDD=pd.read_csv('../data/old_HDD.csv')

old_HDD.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [1667]:
old_HDD.drop_duplicates().shape == old_HDD.shape

True

In [1668]:
old_HDD.shape

(1000, 5)

In [1669]:
old_HDD.isna().sum()

first_name      0
last_name       0
title           0
release_year    0
category_id     0
dtype: int64

In [1670]:
# Renombramos la tabla ya que posteriormente crearemos otra con este CSV por OLD_HDD-films_actors y borramos las columnas que no necesitamos.

old_HDD_film_actors = old_HDD.drop(['release_year','category_id'], axis = 1)

In [1671]:
old_HDD_film_actors.columns

Index(['first_name', 'last_name', 'title'], dtype='object')

In [1672]:
old_HDD_film_actors.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  1000 non-null   object
 1   last_name   1000 non-null   object
 2   title       1000 non-null   object
dtypes: object(3)
memory usage: 192.0 KB

In [1673]:
# Juntamos las columnas first_name y last_name en una nueva llamada complete_name ya que haremos un join con la tabla de actor.

complete_name = old_HDD_film_actors.first_name + " " + old_HDD_film_actors.last_name

complete_name

0      PENELOPE GUINESS
1      PENELOPE GUINESS
2      PENELOPE GUINESS
3      PENELOPE GUINESS
4      PENELOPE GUINESS
             ...
995        GOLDIE BRODY
996        GOLDIE BRODY
997        GOLDIE BRODY
998        GOLDIE BRODY
999        GOLDIE BRODY
Length: 1000, dtype: object

In [1674]:
# Nombramos la nueva columna

old_HDD_film_actors ['complete_name'] = complete_name

In [1675]:
old_HDD_film_actors.head()

  first_name last_name                  title     complete_name
0   PENELOPE   GUINESS       ACADEMY DINOSAUR  PENELOPE GUINESS
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS  PENELOPE GUINESS
2   PENELOPE   GUINESS            ANGELS LIFE  PENELOPE GUINESS
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS  PENELOPE GUINESS
4   PENELOPE   GUINESS          CHEAPER CLYDE  PENELOPE GUINESS

In [1676]:
film.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [1677]:
# Hacemos un join (merge) con la tabla actor y film para poderlas juntar por actor_id y film_id.

filmactor=old_HDD_film_actors.merge(actor, on='complete_name').merge(film, on='title')[['actor_id', 'film_id']]

In [1678]:
filmactor.head()

   actor_id  film_id
0         1        1
1        10        1
2        20        1
3        30        1
4         1       23

# Nueva Tabla 'FILMCATEGORY' que la creamos con la de 'OLD-HDD'

In [1679]:
#old_HDD2=pd.read_csv('../data/old_HDD.csv')

#old_HDD2.head()

# No la volvemos a descargar ya que la tenemos de antes y como no la hemos sobreescrito podemos reutilizarla.

In [1680]:
#Borramos las columnas que nos nos interesan.

old_HDD_category_films = old_HDD.drop(['release_year','first_name','last_name'], axis = 1)

In [1681]:
# Nombramos la nueva tabla filmcategory y hacemos un join (merge) para unirla con las tablas film y category, por film_id y category_id.

filmcategory = old_HDD_category_films.merge(film, on='title')[['film_id', 'category_id']]

In [1682]:
filmcategory.shape

(1000, 2)

In [1683]:
filmcategory.head()

   film_id  category_id
0        1            6
1        1            6
2        1            6
3        1            6
4       23            2

In [1684]:
filmcategory = filmcategory.drop_duplicates()

In [1685]:
filmcategory.shape

(614, 2)

In [1686]:
filmcategory.head()

    film_id  category_id
0         1            6
4        23            2
7        25           13
10      106           10
11      140           14

# Tabla 'RENTAL'

In [1687]:
# Descargamos el CSV de la tabla 'RENTAL'

rental=pd.read_csv('../data/rental.csv')

rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [1688]:
rental.drop_duplicates().shape == old_HDD.shape

False

In [1689]:
rental.shape

(1000, 7)

In [1690]:
rental.isna().sum()

rental_id       0
rental_date     0
inventory_id    0
customer_id     0
return_date     0
staff_id        0
last_update     0
dtype: int64

In [1691]:

rental.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 254.0 KB

In [1692]:
# Creamos una nueva tabla de Rental con un inner join (merge) donde el inventory_id se junte y nos de solo en aquellos que coincidan tanto en la tabla de Inventory como en la de Rental.

new_rental = pd.merge(rental, inventory, on='inventory_id', how='inner')

In [1693]:
new_rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update_x,film_id,store_id,last_update_y
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,80,1,2006-02-15 05:09:17
1,16,2005-05-25 00:43:11,389,316,2005-05-26 04:42:11,2,2006-02-15 21:30:53,86,1,2006-02-15 05:09:17
2,17,2005-05-25 01:06:36,830,575,2005-05-27 00:43:36,1,2006-02-15 21:30:53,181,2,2006-02-15 05:09:17
3,21,2005-05-25 01:59:46,146,388,2005-05-26 01:01:46,2,2006-02-15 21:30:53,31,1,2006-02-15 05:09:17
4,22,2005-05-25 02:19:23,727,509,2005-05-26 04:52:23,2,2006-02-15 21:30:53,159,1,2006-02-15 05:09:17

In [1694]:
# Metemos en la nueva tabla todas las columnas que hab√≠a con la nueva inventory_id.

new_rental = new_rental[['rental_id', 'rental_date', 'inventory_id', 'customer_id', 'return_date', 'staff_id', 'last_update_x', ]]

In [1695]:
new_rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update_x
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,16,2005-05-25 00:43:11,389,316,2005-05-26 04:42:11,2,2006-02-15 21:30:53
2,17,2005-05-25 01:06:36,830,575,2005-05-27 00:43:36,1,2006-02-15 21:30:53
3,21,2005-05-25 01:59:46,146,388,2005-05-26 01:01:46,2,2006-02-15 21:30:53
4,22,2005-05-25 02:19:23,727,509,2005-05-26 04:52:23,2,2006-02-15 21:30:53

In [1696]:
# Miramos las filas que tiene ahora y las que ten√≠a antes.

new_rental.shape

(212, 7)

In [1697]:
rental.shape

(1000, 7)

In [1698]:
# Conectamos con el servidor.

str_conn='mysql+pymysql://root:ironhack@127.0.0.1:3306'

cursor=create_engine(str_conn)

cursor.execute('drop database if exists videoclub;')

cursor.execute('create database videoclub;')

In [1699]:
str_conn = str_conn + '/videoclub'

cursor = create_engine(str_conn)

In [1700]:
# Ejecutamos los csv ya filtrados para que se carguen en el database videoclub Y nos aparezca en SQL.

actor.to_sql(name='actor', con=cursor, if_exists='replace', index=False)
category.to_sql(name='category', con=cursor, if_exists='replace', index=False)
film.to_sql(name='film', con=cursor, if_exists='replace', index=False)
inventory.to_sql(name='inventory', con=cursor, if_exists='replace', index=False)
language.to_sql(name='language', con=cursor, if_exists='replace', index=False)
filmactor.to_sql(name='filmactor', con=cursor, if_exists='replace', index=False)
filmcategory.to_sql(name='filmcategory', con=cursor, if_exists='replace', index=False)
new_rental.to_sql(name='rental', con=cursor, if_exists='replace', index=False)

In [1701]:
# Creamos las Primary Keys y las Foreing Keys de todas las tablas para que si cambiamos algo se ejecuten directamente desde aqu√≠.

#Primary key
cursor.execute("ALTER TABLE `videoclub`.`film` CHANGE COLUMN `film_id` `film_id` BIGINT NOT NULL ,ADD PRIMARY KEY (`film_id`);;")

cursor.execute("ALTER TABLE `videoclub`.`actor` CHANGE COLUMN `actor_id` `actor_id` BIGINT NOT NULL ,ADD PRIMARY KEY (`actor_id`);;")

cursor.execute("ALTER TABLE `videoclub`.`language` CHANGE COLUMN `language_id` `language_id` BIGINT NOT NULL ,ADD PRIMARY KEY (`language_id`);;")

cursor.execute("ALTER TABLE `videoclub`.`inventory` CHANGE COLUMN `inventory_id` `inventory_id` BIGINT NOT NULL ,ADD PRIMARY KEY (`inventory_id`);;")

cursor.execute("ALTER TABLE `videoclub`.`category` CHANGE COLUMN `category_id` `category_id` BIGINT NOT NULL ,ADD PRIMARY KEY (`category_id`);;")

cursor.execute("ALTER TABLE `videoclub`.`rental` CHANGE COLUMN `rental_id` `rental_id` BIGINT NOT NULL ,ADD PRIMARY KEY (`rental_id`);;")


#Foreing key language_id en la tabla film
cursor.execute("ALTER TABLE `videoclub`.`film` ADD INDEX `language_id_idx` (`language_id` ASC) VISIBLE;;")
cursor.execute("ALTER TABLE `videoclub`.`film` ADD CONSTRAINT `film_language_id_language`  FOREIGN KEY (`language_id`)  REFERENCES `videoclub`.`language` (`language_id`)  ON DELETE NO ACTION  ON UPDATE NO ACTION;")


#Foreing key actor_id en la tabla filmactor
cursor.execute("ALTER TABLE `videoclub`.`filmactor` ADD INDEX `actor_id_idx` (`actor_id` ASC) VISIBLE;;")
cursor.execute("ALTER TABLE `videoclub`.`filmactor` ADD CONSTRAINT `filmactor_actor_id_actor` FOREIGN KEY (`actor_id`) REFERENCES `videoclub`.`actor` (`actor_id`) ON DELETE NO ACTION ON UPDATE NO ACTION;")


#Foreing key film_id en la tabla filmactor
cursor.execute("ALTER TABLE `videoclub`.`filmactor` ADD INDEX `film_id_idx` (`film_id` ASC) VISIBLE;;")
cursor.execute("ALTER TABLE `videoclub`.`filmactor` ADD CONSTRAINT `filmactor_film_id_film` FOREIGN KEY (`film_id`) REFERENCES `videoclub`.`film` (`film_id`) ON DELETE NO ACTION ON UPDATE NO ACTION;")


#Foreing key film_id en la tabla filmcategory
cursor.execute("ALTER TABLE `videoclub`.`filmcategory` ADD INDEX `film_id_idx` (`film_id` ASC) VISIBLE;;")
cursor.execute("ALTER TABLE `videoclub`.`filmcategory` ADD CONSTRAINT `filmcategory_film_id_film` FOREIGN KEY (`film_id`) REFERENCES `videoclub`.`film` (`film_id`) ON DELETE NO ACTION ON UPDATE NO ACTION;")


#Foreing key category_id en la tabla filmcategory
cursor.execute("ALTER TABLE `videoclub`.`filmcategory` ADD INDEX `category_id_idx` (`category_id` ASC) VISIBLE;;")
cursor.execute("ALTER TABLE `videoclub`.`filmcategory` ADD CONSTRAINT `filmcategory_category_id_film` FOREIGN KEY (`category_id`) REFERENCES `videoclub`.`category` (`category_id`) ON DELETE NO ACTION ON UPDATE NO ACTION;")


#Foreing key film_id en la tabla inventory
cursor.execute("ALTER TABLE `videoclub`.`inventory` ADD INDEX `film_id_idx` (`film_id` ASC) VISIBLE;;")
cursor.execute("ALTER TABLE `videoclub`.`inventory` ADD CONSTRAINT `inventory_film_id_film` FOREIGN KEY (`film_id`) REFERENCES `videoclub`.`film` (`film_id`) ON DELETE NO ACTION ON UPDATE NO ACTION;")


#Foreing key inventory_id en la tabla rental
cursor.execute("ALTER TABLE `videoclub`.`rental` ADD INDEX `inventory_id_idx` (`inventory_id` ASC) VISIBLE;;")
cursor.execute("ALTER TABLE `videoclub`.`rental` ADD CONSTRAINT `rental_inventory_id_inventory` FOREIGN KEY (`inventory_id`) REFERENCES `videoclub`.`inventory` (`inventory_id`) ON DELETE NO ACTION ON UPDATE NO ACTION;")

In [1702]:
#Cerramos cursor

cursor.dispose()